[
{"title": "Level 1 Food Safety","duration": "4 - 6 hours","delivery": "100% Online","description": "This certificate is required for food handlers in kitchens or prep areas, including cafes, hotels, hospitals, aged care, schools, and catering. It applies to anyone handling food or contact surfaces, such as chefs, cooks, stewards, kitchen hands, and bar staff. Whether in fast food, events, or transport, this training ensures staff possess the skills to maintain safety and hygiene standards.","logo": "https://img.logo.dev/clubtraining.com.au?token=pk_O-rwBqrmS1e8yGNQkUX5mg","link": "https://course.gippslander.com.au/cta-training-2"},
{"title": "Level 2 Food Safety","duration": "6 - 9 hours","delivery": "100% Online","description": "The SITXFSA006 Participate in Safe Food Handling Practices course is recommended for all food handlers who work in hospitality. This includes cooks, chefs, kitchen hands, bartenders, and wait staff. Anyone who handles food or works with food-contact surfaces such as cutlery, glasses, plates, etc., can benefit from this training.","logo": "https://img.logo.dev/clubtraining.com.au?token=pk_O-rwBqrmS1e8yGNQkUX5mg","link": "https://course.gippslander.com.au/cta-training-5"},
{"title": "RSA Online Course Victoria","duration": "6 hours","delivery": "100% Online","description": "In Victoria, RSA training is mandatory for anyone selling, offering, or serving alcohol under the following liquor licences: general, on-premises, late-night, or packaged liquor. If employed without one, you must complete the course within one month of starting employment. Upon completing your course, CTA training specialists will email you your Statement of Attainment and after finishing an additional online module through Liquor Control Victoria (LCV), they will mail you your official Certificate","logo": "https://img.logo.dev/clubtraining.com.au?token=pk_O-rwBqrmS1e8yGNQkUX5mg","link": "https://course.gippslander.com.au/cta-training-1"},
{"title": "VIC Food Safety Supervisor","duration": "10 hours","delivery": "100% Online","description": "The Food Safety Supervisor manages food safety to ensure compliance with the Food Act 1984. This role is vital for public health and hygienic business operations. Victorian food businesses must appoint a supervisor with a valid certificate. This is obtained by finishing a nationally accredited training course. It covers safe handling, hazards, and hygiene. Training includes assessments to verify skills.","logo": "https://img.logo.dev/clubtraining.com.au?token=pk_O-rwBqrmS1e8yGNQkUX5mg","link": "https://course.gippslander.com.au/cta-training-3"},
{"title": "Barista Essentials","duration": "3 hours","delivery": "100% Online","description": "This barista essentials online training course provides students with the basic knowledge and skills required to produce and serve coffee using a commercial espresso machine.","logo": "https://img.logo.dev/clubtraining.com.au?token=pk_O-rwBqrmS1e8yGNQkUX5mg","link": "https://course.gippslander.com.au/cta-training-8"},
{"title": "Customer Service Training","duration": "3 hours","delivery": "100% Online","description": "This online customer service course is designed to brush up on or provide introductory knowledge and skills for working in the hospitality industry.","logo": "https://img.logo.dev/clubtraining.com.au?token=pk_O-rwBqrmS1e8yGNQkUX5mg","link": "https://course.gippslander.com.au/cta-training-9"},
{"title": "Chemical Hazards","duration": "1 hour","delivery": "100% Online","description": "This Chemical Hazards online course provides individuals with the basic knowledge of when to use chemicals, what to use and how to use them safely.","logo": "https://img.logo.dev/clubtraining.com.au?token=pk_O-rwBqrmS1e8yGNQkUX5mg","link": "https://course.gippslander.com.au/cta-training-10"},
{"title": "Fire Safety Awareness","duration": "3 hours","delivery": "100% Online","description": "It aims to equip staff with the necessary knowledge and skills to respond effectively to fire and emergency situations within a hospitality venue to ensure the safety of staff and patrons. This training will teach you how to identify potential fire hazards, use fire safety equipment, and execute evacuation plans efficiently. By the end of this course, you will be confident in your ability to manage fire-related emergencies and contribute to a safer working environment.","logo": "https://img.logo.dev/clubtraining.com.au?token=pk_O-rwBqrmS1e8yGNQkUX5mg","link": "https://course.gippslander.com.au/cta-training-11"},
{"title": "Food Safety Procedures","duration": "9 - 10 hours","delivery": "100% Online","description": "This online training course provides the nationally recognised certificate for FBPFSY2002 Apply food safety procedures and allows you to work in the food processing sector in QLD, NSW, WA, NT, VIC, ACT and SA.","logo": "https://img.logo.dev/clubtraining.com.au?token=pk_O-rwBqrmS1e8yGNQkUX5mg","link": "https://course.gippslander.com.au/cta-training-13"},
{"title": "Fire Warden Training","duration": "3 hours","delivery": "100% Online","description": "Being a Fire Warden in the workplace is an essential responsibility to ensure all individuals’ safety during an emergency. Fire warden training provides crucial knowledge on how to prevent emergencies and manage evacuation situations effectively.","logo": "https://img.logo.dev/clubtraining.com.au?token=pk_O-rwBqrmS1e8yGNQkUX5mg","link": "https://course.gippslander.com.au/cta-training-16"},
]
